# i = 1000
# while i > 100:
#     print(i)
#     i /= 2
# for j in 'hello worlld':
#     print(j * 3, end = '')
# for j in 'hello worlld':
#     if j == 'w':
#         break
#     #print(j * 2, end = '')
# else:
#     print ('No letter A in this word')

# for i in 'Good morning':
#     if i == "d":
#         break
# else:
#     print("Fuck")
#Home work lesson 2
#Task_2.1
# health_level = int(input("please enter level of health for the game hero:"))
# if health_level <= 0:
#     print("False")
# else:
#     print("True")

#Task_2.2 #остаток при делении на 2 должен быть 0 - это значит четное число

# number = int(input("Please enter your number:"))
# if (number % 2 ==0):
#     print("Четное")
# else:
#     print("Нечетное")

#Task_2.3  Високосный год без остатка делится на 4 и не являются столетиями (500, 600) то есть делится на 100.
#И если год деиться на 400,то тоже является високосным

# year = int(input("Please enater year:"))
# if (year % 4 == 0) and ((year %100 !=0)) or (year % 400 ==0):
#     print("Високосный год")
# else:
#     print("Не високосный год")

#Task_2.4 Напишите программу, которая печатает введенный текст заданное количество раз, построчно.
# Текст и количество повторений нужно ввести с помощью input()

# new_text = input('Please enter text:')
# for g in range(12):
#     print(g, new_text)

# arr = [(input("Enter text:")), (input("Enter text:"))]
# for j in range(2):
#     print(arr)



